### Plan `infra/foundation`
```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_artifact_registry_repository.ml_experiments will be created
  + resource "google_artifact_registry_repository" "ml_experiments" {
      + create_time      = (known after apply)
      + description      = "Repository for CNN hybrid experiment images"
      + effective_labels = (known after apply)
      + format           = "DOCKER"
      + id               = (known after apply)
      + location         = "us-central1"
      + mode             = "STANDARD_REPOSITORY"
      + name             = (known after apply)
      + project          = "cnn-hybrid-experiments-infra"
      + repository_id    = "ml-experiments-cnn-hybrid-experiments-infra-us-central1"
      + terraform_labels = (known after apply)
      + update_time      = (known after apply)
    }

  # google_bigquery_dataset.experiments will be created
  + resource "google_bigquery_dataset" "experiments" {
      + creation_time              = (known after apply)
      + dataset_id                 = "experiments"
      + default_collation          = (known after apply)
      + delete_contents_on_destroy = false
      + effective_labels           = (known after apply)
      + etag                       = (known after apply)
      + id                         = (known after apply)
      + is_case_insensitive        = (known after apply)
      + last_modified_time         = (known after apply)
      + location                   = "us-central1"
      + max_time_travel_hours      = (known after apply)
      + project                    = "cnn-hybrid-experiments-infra"
      + self_link                  = (known after apply)
      + storage_billing_model      = (known after apply)
      + terraform_labels           = (known after apply)

      + access (known after apply)
    }

  # google_monitoring_dashboard.ml_dashboard will be created
  + resource "google_monitoring_dashboard" "ml_dashboard" {
      + dashboard_json = jsonencode(
            {
              + displayName = "ML Foundation Dashboard"
              + gridLayout  = {
                  + columns = 2
                  + widgets = []
                }
            }
        )
      + id             = (known after apply)
      + project        = "cnn-hybrid-experiments-infra"
    }

  # google_pubsub_subscription.train_pull will be created
  + resource "google_pubsub_subscription" "train_pull" {
      + ack_deadline_seconds       = (known after apply)
      + effective_labels           = (known after apply)
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "ml-train-pull"
      + project                    = "cnn-hybrid-experiments-infra"
      + terraform_labels           = (known after apply)
      + topic                      = "ml-train"

      + expiration_policy (known after apply)
    }

  # google_pubsub_topic.train will be created
  + resource "google_pubsub_topic" "train" {
      + effective_labels = (known after apply)
      + id               = (known after apply)
      + name             = "ml-train"
      + project          = "cnn-hybrid-experiments-infra"
      + terraform_labels = (known after apply)

      + message_storage_policy (known after apply)

      + schema_settings (known after apply)
    }

  # google_pubsub_topic.train_dlq will be created
  + resource "google_pubsub_topic" "train_dlq" {
      + effective_labels = (known after apply)
      + id               = (known after apply)
      + name             = "ml-train-dlq"
      + project          = "cnn-hybrid-experiments-infra"
      + terraform_labels = (known after apply)

      + message_storage_policy (known after apply)

      + schema_settings (known after apply)
    }

  # google_service_account.pubsub_publisher will be created
  + resource "google_service_account" "pubsub_publisher" {
      + account_id   = "sa-pubsub-publisher"
      + disabled     = false
      + display_name = "Publisher for ML Topics"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "cnn-hybrid-experiments-infra"
      + unique_id    = (known after apply)
    }

  # google_service_account.vertex_jobs will be created
  + resource "google_service_account" "vertex_jobs" {
      + account_id   = "sa-vertex-jobs"
      + disabled     = false
      + display_name = "Service Account for Vertex AI Jobs"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "cnn-hybrid-experiments-infra"
      + unique_id    = (known after apply)
    }

  # google_storage_bucket.datasets will be created
  + resource "google_storage_bucket" "datasets" {
      + effective_labels            = (known after apply)
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "US-CENTRAL1"
      + name                        = "ml-datasets-cnn-hybrid-experiments-infra-us-central1"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = (known after apply)
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # google_storage_bucket.ml_data will be created
  + resource "google_storage_bucket" "ml_data" {
      + effective_labels            = (known after apply)
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "US-CENTRAL1"
      + name                        = "cnn-hybrid-experiments-infra-ml-data"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = (known after apply)
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # google_storage_bucket.ml_logs will be created
  + resource "google_storage_bucket" "ml_logs" {
      + effective_labels            = (known after apply)
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "US-CENTRAL1"
      + name                        = "cnn-hybrid-experiments-infra-ml-logs"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = (known after apply)
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # google_storage_bucket.ml_outputs will be created
  + resource "google_storage_bucket" "ml_outputs" {
      + effective_labels            = (known after apply)
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "US-CENTRAL1"
      + name                        = "cnn-hybrid-experiments-infra-ml-outputs"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = (known after apply)
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # google_vertex_ai_dataset.placeholder will be created
  + resource "google_vertex_ai_dataset" "placeholder" {
      + create_time         = (known after apply)
      + display_name        = "placeholder-tables-dataset"
      + effective_labels    = (known after apply)
      + id                  = (known after apply)
      + metadata_schema_uri = "gs://google-cloud-aiplatform/schema/dataset/metadata/tables_1.0.0.yaml"
      + name                = (known after apply)
      + project             = "cnn-hybrid-experiments-infra"
      + region              = "us-central1"
      + terraform_labels    = (known after apply)
      + update_time         = (known after apply)
    }

  # google_vertex_ai_endpoint.ml_endpoint will be created
  + resource "google_vertex_ai_endpoint" "ml_endpoint" {
      + create_time                     = (known after apply)
      + deployed_models                 = (known after apply)
      + description                     = "A sample vertex endpoint"
      + display_name                    = "ml endpoint from vertex ai endpoint"
      + effective_labels                = (known after apply)
      + etag                            = (known after apply)
      + id                              = (known after apply)
      + location                        = "us-central1"
      + model_deployment_monitoring_job = (known after apply)
      + name                            = "endpoint-ml-cnn-hybrid-experiments-infra-us-central1"
      + project                         = "cnn-hybrid-experiments-infra"
      + region                          = "us-central1"
      + terraform_labels                = (known after apply)
      + update_time                     = (known after apply)
    }

Plan: 14 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + artifact_registry_repo_id      = "ml-experiments-cnn-hybrid-experiments-infra-us-central1"
  + artifact_registry_repo_url     = "us-central1-docker.pkg.dev/cnn-hybrid-experiments-infra/ml-experiments-cnn-hybrid-experiments-infra-us-central1"
  + bigquery_dataset_id            = "experiments"
  + bigquery_dataset_self_link     = (known after apply)
  + bucket_ml_data                 = "cnn-hybrid-experiments-infra-ml-data"
  + bucket_ml_logs                 = "cnn-hybrid-experiments-infra-ml-logs"
  + bucket_ml_outputs              = "cnn-hybrid-experiments-infra-ml-outputs"
  + datasets_bucket_url            = "gs://ml-datasets-cnn-hybrid-experiments-infra-us-central1"
  + monitoring_dashboard_id        = (known after apply)
  + pubsub_subscription_train_pull = "ml-train-pull"
  + pubsub_topic_train             = "ml-train"
  + pubsub_topic_train_dlq         = "ml-train-dlq"
  + sa_pubsub_publisher_email      = (known after apply)
  + sa_vertex_jobs_email           = (known after apply)
  + vertex_ai_dataset_id           = (known after apply)
  + vertex_ai_dataset_name         = (known after apply)
  + vertex_ai_endpoint_id          = (known after apply)
  + vertex_ai_endpoint_name        = "endpoint-ml-cnn-hybrid-experiments-infra-us-central1"

```